Revit 2024 API
RebarConstraintsManager Properties
The RebarConstraintsManager type exposes the following members.
Properties
Name | Description
IsRebarConstrainedPlacementEnabled
 A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace